# 1- Preprocessing

## Open the file

In [50]:
import pandas as pd

In [51]:
hwork=pd.read_csv("hw_data.csv")

## Examine file

In [25]:
hwork.head()

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Product Category,Satisfaction Level,Debt Status
0,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,1
1,1,73,Female,College,54465.0,NaN,0.0,E,5,1
2,2,68,Male,High School,37427.0,married,0.0,D,1,1
3,3,61,Female,College,52210.0,widowed,0.0,G,8,1
4,4,34,Female,College,59325.0,separated,1.0,A,5,0

In [26]:
hwork.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          110 non-null    int64
 1   Age                 110 non-null    int64
 2   Gender              110 non-null    object
 3   Education Level     93 non-null     object
 4   Income              98 non-null     float64
 5   Marital Status      91 non-null     object
 6   Employment Status   75 non-null     float64
 7   Product Category    97 non-null     object
 8   Satisfaction Level  110 non-null    int64
 9   Debt Status         110 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 8.7+ KB

In [10]:
hwork.describe()

,Unnamed: 0,Age,Income,Employment Status,Satisfaction Level,Debt Status
count,110.000000,110.000000,9.800000e+01,75.000000,110.000000,110.000000
mean,49.390909,98.027273,5.752785e+07,0.573333,4.527273,0.463636
std,28.794780,143.933500,1.768291e+08,0.497924,2.801406,0.500958
min,0.000000,0.000000,6.740000e+03,0.000000,0.000000,0.000000
25%,26.250000,30.250000,3.115800e+04,0.000000,2.000000,0.000000
50%,49.500000,54.000000,3.870250e+04,1.000000,5.000000,0.000000
75%,73.750000,84.000000,5.033350e+04,1.000000,7.000000,1.000000
max,99.000000,500.000000,8.633051e+08,1.000000,9.000000,1.000000

## Define missing values

In [27]:
hwork.isna()

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Product Category,Satisfaction Level,Debt Status
0,False,False,False,True,False,True,True,True,False,False
1,False,False,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
105,False,False,False,False,False,False,True,False,False,False
106,False,False,False,True,False,True,True,True,False,False
107,False,False,False,False,False,False,False,False,False,False
108,False,False,False,False,False,False,True,False,False,False
109,False,False,False,False,False,False,False,False,False,False

In [28]:
hwork.isna().sum()

Unnamed: 0             0
Age                    0
Gender                 0
Education Level       17
Income                12
Marital Status        19
Employment Status     35
Product Category      13
Satisfaction Level     0
Debt Status            0
dtype: int64

In [22]:
hwork.isna().sum()/len(hwork)

Unnamed: 0            0.000000
Age                   0.000000
Gender                0.000000
Education Level       0.154545
Income                0.109091
Marital Status        0.172727
Employment Status     0.318182
Product Category      0.118182
Satisfaction Level    0.000000
Debt Status           0.000000
dtype: float64

In [ ]:
hwork[hwork['Education Level'].isna()]

In [ ]:
hwork[hwork['Income'].isna()]

In [ ]:
hwork[hwork['Marital Status'].isna()]

In [ ]:
hwork[hwork['Employment Status'].isna()]

In [ ]:
hwork[hwork['Product Category'].isna()]

## Decide about missing values (fill or drop)

In [30]:
hwork["Education Level"].mode()[0] #We find the most repeated value and fill in the missing values with it.

'University'

In [31]:
hwork["Education Level"].fillna(hwork["Education Level"].mode()[0], inplace=True)

In [32]:
hwork["Marital Status"].mode()[0]

'separated'

In [33]:
hwork["Marital Status"].fillna(hwork["Marital Status"].mode()[0], inplace=True)

In [35]:
hwork["Income"].mean()

57527845.1632653

In [36]:
hwork["Income"].fillna(hwork["Income"].mean(), inplace=True)

In [38]:
hwork.drop("Product Category", axis=1, inplace=True)

## Why did you fill missing values or if you have dropped, why did you do so?

Since the rate of missing data in the Marital Status and Education Level variables is also high, we can exclude some of these variables from the data set. However, since the rate of missing data in other variables is low, it would be more appropriate to fill in missing data in these variables.

## Find outliers if there are

In [40]:
hwork.describe()

,Unnamed: 0,Age,Income,Employment Status,Satisfaction Level,Debt Status
count,110.000000,110.000000,1.100000e+02,75.000000,110.000000,110.000000
mean,49.390909,98.027273,5.752785e+07,0.573333,4.527273,0.463636
std,28.794780,143.933500,1.668116e+08,0.497924,2.801406,0.500958
min,0.000000,0.000000,6.740000e+03,0.000000,0.000000,0.000000
25%,26.250000,30.250000,3.156025e+04,0.000000,2.000000,0.000000
50%,49.500000,54.000000,4.132650e+04,1.000000,5.000000,0.000000
75%,73.750000,84.000000,5.983875e+04,1.000000,7.000000,1.000000
max,99.000000,500.000000,8.633051e+08,1.000000,9.000000,1.000000

In [44]:
#Identifying outliers in the Age column
Q1 = hwork['Age'].quantile(0.25)
Q3 = hwork['Age'].quantile(0.75)
IQR = Q3 - Q1
lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

#Identifying outliers
outliers = hwork[(hwork['Age'] < lower_limit) | (hwork['Age'] > upper_limit)]
print(outliers)

     Unnamed: 0  Age  Gender Education Level       Income Marital Status
0             0  500  Female      University      31158.0      separated  \
10           10  500  Female         College      31654.0  never married
20           20  500  Female      University      64165.0      separated
30           30  500  Female     High School      18442.0      separated
40           40  500  Female         College      45140.0        widowed
50           50  500    Male      University  575772080.0        married
60           60  500  Female         College      34060.0      separated
70           70  500    Male     High School      21593.0  never married
80           80  500    Male      University      60010.0        married
90           90  500  Female      University      31759.0      separated
106           0  500  Female      University      31158.0      separated
109          30  500  Female     High School      18442.0      separated

     Employment Status  Satisfaction Level  Debt Status
0                  NaN                   9            1
10                 1.0                   7            0
20                 0.0                   2            1
30                 1.0                   3            0
40                 0.0                   9            0
50                 0.0                   5            0
60                 1.0                   7            0
70                 NaN                   3            1
80                 1.0                   7            1
90                 1.0                   6            0
106                NaN                   9            0
109                1.0                   3            0

In [45]:
#Identifying outliers in the Income column
Q1 = hwork['Income'].quantile(0.25)
Q3 = hwork['Income'].quantile(0.75)
IQR = Q3 - Q1
lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

#Identifying outliers
outliers = hwork[(hwork['Income'] < lower_limit) | (hwork['Income'] > upper_limit)]
print(outliers)

     Unnamed: 0  Age  Gender Education Level        Income Marital Status
14           14   70    Male     High School  8.633051e+08      separated  \
15           15   58  Female      University  5.752785e+07      separated
22           22    9    Male      Elementary  5.752785e+07      separated
23           23   48  Female      University  1.951440e+08      separated
29           29   39    Male     High School  5.752785e+07      separated
32           32   81  Female         College  3.146962e+08  never married
36           36    6    Male      Elementary  5.752785e+07  never married
41           41    1    Male      University  8.623863e+08        married
43           43   40  Female         College  5.752785e+07        married
50           50  500    Male      University  5.757721e+08        married
57           57   20    Male      University  5.752785e+07      separated
59           59   90    Male         College  3.002459e+08        widowed
64           64   70    Male      University  5.752785e+07        married
68           68   46    Male      University  7.777620e+08        married
71           71   58    Male     High School  5.752785e+07        widowed
77           77   99  Female      Elementary  2.864215e+08        widowed
78           78   30  Female      Elementary  5.752785e+07       divorced
85           85   94  Female     High School  5.752785e+07      separated
86           86   31  Female     High School  5.052504e+08      separated
92           92   39    Male      University  5.752785e+07      separated
95           95   39    Male     High School  1.481123e+08        widowed
100          29   39    Male     High School  5.752785e+07      separated
101          86   31  Female     High School  5.052504e+08      separated
103          59   90    Male         College  3.002459e+08        widowed

     Employment Status  Satisfaction Level  Debt Status
14                 0.0                   4            1
15                 NaN                   5            0
22                 0.0                   1            0
23                 NaN                   1            0
29                 1.0                   4            0
32                 1.0                   5            1
36                 1.0                   7            1
41                 NaN                   1            0
43                 NaN                   1            0
50                 0.0                   5            0
57                 0.0                   6            1
59                 0.0                   6            1
64                 1.0                   7            1
68                 1.0                   8            0
71                 0.0                   9            0
77                 1.0                   2            0
78                 0.0                   3            0
85                 0.0                   4            0
86                 1.0                   4            1
92                 0.0                   0            0
95                 NaN                   8            1
100                1.0                   4            0
101                1.0                   4            1
103                0.0                   6            1

In this dataset, there seem to be outliers in the "Age" and "Income" columns. The "Age" column shows the maximum value as 500, which is not a realistic value. The "Income" column also shows the maximum value as 575772080.0, which is not a realistic income value and is very different from other observations. Therefore, a value of 500 for the "Age" column is an outlier, and a value of 575772080.0  for the "Income" column is an outlier.

## Decide what will you do with outliers

Since there are many outliers in the age column, I can replace it with the average, I can delete the Income column.

## Find duplicates, how many are there? Decide what will you do about that?

In [47]:
hwork[hwork.duplicated()]

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Satisfaction Level,Debt Status
100,29,39,Male,High School,5.752785e+07,separated,1.0,4,0
101,86,31,Female,High School,5.052504e+08,separated,1.0,4,1
103,59,90,Male,College,3.002459e+08,widowed,0.0,6,1
109,30,500,Female,High School,1.844200e+04,separated,1.0,3,0

In [48]:
hwork.drop_duplicates()

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Satisfaction Level,Debt Status
0,0,500,Female,University,31158.0,separated,NaN,9,1
1,1,73,Female,College,54465.0,separated,0.0,5,1
2,2,68,Male,High School,37427.0,married,0.0,1,1
3,3,61,Female,College,52210.0,widowed,0.0,8,1
4,4,34,Female,College,59325.0,separated,1.0,5,0
...,...,...,...,...,...,...,...,...,...
104,84,63,Male,High School,45571.0,married,NaN,0,0
105,56,85,Female,University,39063.0,divorced,NaN,8,0
106,0,500,Female,University,31158.0,separated,NaN,9,0
107,73,39,Female,College,55750.0,married,1.0,5,1
108,28,80,Female,High School,32142.0,separated,NaN,7,1

## Explain why did you do that?

# 2- Categorization

## Categorize satisfaction in 3 level and label them as 'Low', 'Moderate' and 'High'. Add a new column named 'Satisfaction Category' and store them there

#### ||| Low Satisfaction : (1-3) ||| Moderate Satisfaction : (4-7) ||| High Satisfaction : (8-10) |||

In [66]:
low_st = hwork[hwork["Satisfaction Level"] < 4]
moderate_st = hwork[(hwork["Satisfaction Level"] >= 4) & (hwork["Satisfaction Level"] <= 7)]
high_st = hwork[hwork["Satisfaction Level"] > 7]

In [67]:
hwork["Satisfaction Category"] = pd.cut(hwork["Satisfaction Level"], bins=[0, 3, 6, 9], labels=["low_st", "moderate_st", "high_st"])

## Categorize income in 3 level and label them as 'Low', 'Moderate' and 'High'. Add a new column named 'Income Category' and store them there

In [72]:
hwork["Income Category"] = pd.cut(hwork["Income"], 
                                  bins=[0, 30000, 60000, float("inf")], 
                                  labels=["Low", "Moderate", "High"])

In [73]:
hwork.drop("Memnuniyet Kategorisi", axis=1)

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Product Category,Satisfaction Level,Debt Status,Satisfaction Category,Income Category
0,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,1,high_st,Moderate
1,1,73,Female,College,54465.0,NaN,0.0,E,5,1,moderate_st,Moderate
2,2,68,Male,High School,37427.0,married,0.0,D,1,1,low_st,Moderate
3,3,61,Female,College,52210.0,widowed,0.0,G,8,1,high_st,Moderate
4,4,34,Female,College,59325.0,separated,1.0,A,5,0,moderate_st,Moderate
...,...,...,...,...,...,...,...,...,...,...,...,...
105,56,85,Female,University,39063.0,divorced,NaN,F,8,0,high_st,Moderate
106,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,0,high_st,Moderate
107,73,39,Female,College,55750.0,married,1.0,F,5,1,moderate_st,Moderate
108,28,80,Female,High School,32142.0,separated,NaN,C,7,1,high_st,Moderate
109,30,500,Female,High School,18442.0,separated,1.0,A,3,0,low_st,Low

In [80]:
hwork.head()

,Unnamed: 0,Age,Gender,Education Level,Income,Marital Status,Employment Status,Product Category,Satisfaction Level,Debt Status,Satisfaction Category,Income Category
0,0,500,Female,NaN,31158.0,NaN,NaN,NaN,9,1,high_st,Moderate
1,1,73,Female,College,54465.0,NaN,0.0,E,5,1,moderate_st,Moderate
2,2,68,Male,High School,37427.0,married,0.0,D,1,1,low_st,Moderate
3,3,61,Female,College,52210.0,widowed,0.0,G,8,1,high_st,Moderate
4,4,34,Female,College,59325.0,separated,1.0,A,5,0,moderate_st,Moderate

## Comparing using pivot tables

### Is there a relation between marital status and debt status?

In [82]:
pd.crosstab(hwork['Marital Status'], hwork['Debt Status'])

Debt Status      0   1
Marital Status
divorced         5   7
married         12  11
never married    4   6
separated       14  11
widowed         13   8

It shows that there is a relationship between marital status and debt status.

### Is there a relation between education level and satisfaction category?

In [86]:
pd.crosstab(hwork['Education Level'], hwork['Satisfaction Category'])

Satisfaction Category  low_st  moderate_st  high_st
Education Level
College                     4            7        6
Elementary                 10            2        2
High School                 8           10        8
University                  5           12       11

In this output, it can be seen that there is a relationship between education level and satisfaction categories. For example, it is seen that university graduates are mostly in the high satisfaction categories.

### Is there a relation between employment status and satisfaction category?

In [87]:
pd.crosstab(hwork['Employment Status'], hwork['Satisfaction Category'])

Satisfaction Category  low_st  moderate_st  high_st
Employment Status
0.0                         9           13        7
1.0                        14           17       10

# 4- General Conclusion

-

---

### Checklist

- [x]  start homework;
- [x]  file open;
- [x ]  file examined;
- [x]  missing values defined;
- [x]  missing values are filled;
- [x]  explanation for the possible causes of missing values;
- [x]  an explanation of how the blanks are filled;
- [x]  an explanation of how the blanks are filled;
- [x]  finding outliers;
- [x]  handling outliers;
- [x]  duplicates showed;
- [x]  duplicates deleted;
- [x]  an explanation of which method is used to find and remove duplicates;
- [x]  data is categorized;
- [x]  an answer to the question " Is there a relation betweenmarital status and debt status?";
- [x]  an answer to the question " Is there a relation between income category and debt status?";
- [x]  an answer to the question " Is there a relation between education level and satisfaction category?";
- [x]  an answer to the question " Is there a relation between employment status and satisfaction category?"
- [x]  conclusions are present on each stage;
- [x]  a general conclusion is made.

---